In [15]:
import pandas as pd
# do not show warnings
import warnings
warnings.filterwarnings("ignore")

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [16]:
keys=[1,2,3]
names=["Sadeem","Raneem","Salem"]
q1 = pd.Series(names , index = keys)

In [17]:
q1

1    Sadeem
2    Raneem
3     Salem
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [18]:
q2 = pd.Series(names , index = [11,12,13])

In [19]:
q2

11    Sadeem
12    Raneem
13     Salem
dtype: object

## Q3: Retrieve First and second elements.

In [20]:
q2[0:2]

11    Sadeem
12    Raneem
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [42]:
q4 = pd.Series({4:"Sadeem"})
q1 = q1.append(q4)
q1

1    Sadeem
2    Raneem
3     Salem
4    Sadeem
dtype: object

In [43]:
sum(q1.duplicated())

1

In [44]:
q1.drop_duplicates(inplace = True)

In [45]:
sum(q1.duplicated())

0

In [46]:
q1

1    Sadeem
2    Raneem
3     Salem
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [47]:
 Students ={"ID":[1,2,3],
           "Name" :["Sadeem","Raneem","Salem"],
            "GPA":["Bulgaria", "Euro area","Bulgaria"]
           }

In [50]:
q5 =pd.DataFrame(Students)

In [51]:
q5

   ID    Name        GPA
0   1  Sadeem   Bulgaria
1   2  Raneem  Euro area
2   3   Salem   Bulgaria

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [52]:
q6 = pd.read_csv("educ_figdp_1_Data.csv")

In [54]:
q6.head(3)

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [57]:
#loc use the index labels as references
q6.loc[50:60, ['TIME', 'GEO']]

    TIME                       GEO
50  2002  Euro area (17 countries)
51  2003  Euro area (17 countries)
52  2004  Euro area (17 countries)
53  2005  Euro area (17 countries)
54  2006  Euro area (17 countries)
55  2007  Euro area (17 countries)
56  2008  Euro area (17 countries)
57  2009  Euro area (17 countries)
58  2010  Euro area (17 countries)
59  2011  Euro area (17 countries)
60  2000  Euro area (15 countries)

In [63]:
#slice use the position as references
q6[50:60]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
50,2002,Euro area (17 countries),Total public expenditure on education as % of ...,4.86,e
51,2003,Euro area (17 countries),Total public expenditure on education as % of ...,4.89,e
52,2004,Euro area (17 countries),Total public expenditure on education as % of ...,4.80,e
53,2005,Euro area (17 countries),Total public expenditure on education as % of ...,4.72,e
54,2006,Euro area (17 countries),Total public expenditure on education as % of ...,4.69,e
55,2007,Euro area (17 countries),Total public expenditure on education as % of ...,4.79,e
56,2008,Euro area (17 countries),Total public expenditure on education as % of ...,4.94,e
57,2009,Euro area (17 countries),Total public expenditure on education as % of ...,5.31,e
58,2010,Euro area (17 countries),Total public expenditure on education as % of ...,5.28,e
59,2011,Euro area (17 countries),Total public expenditure on education as % of ...,5.15,e